{
  "bios": [
    {
      "header": "Hello World",
      "paragraphs": [
        "When I was 5 years old my father introduced me to computer programming, and I fell in love. Throughout the next few decades coding remained a part of everything I did, from building simple games to automating repetitive tasks for various temp jobs using VBA. But as much as I enjoyed writing code, it was not obvious to me how to transition into doing it professionally.",
        "Finally, in the fall of 2015, I had an incredible oportunity to jumpstart my career. I attended a coding bootcamp which helped me to hone my skills and prepared me to re-enter the world as a software engineer."
      ]
    },
    {
      "header": "Iteration Cycle",
      "paragraphs": [
        "I've had a chance to work with a lot of different languages, frameworks, and technologies over the past few years. Some of them try to be a swiss army knife and leave it to the developer to figure out where all the hidden pieces are and how to use them, while others just aim at being a tool that fits on your toolbelt. I gravitate toward technologies in the latter category, and, consequently, I have found a home with Clojure.",
        "Clojure is a dynamically typed modern LISP that can be compiled to multiple targets: most notably Java and Javascript runtimes. Most people (who have heard of Clojure) would call it a functional programming language, but I prefer to say it is a pragmatic language that is heavily inspired by functional programming. The distinction is that truely functional programming languages - such as Haskell - place mathematical purity and strict type safety over most other concerns. Clojure, on the other hand, places developer ergonomics and code expressiveness above most other concerns. I love learning new languages, but every time I stray from Clojure I find myself missing some of the core features that make Clojure a true joy to work with and I inevitably come back."
      ]
    },
    {
      "header": "Ship It!",
      "paragraphs": [
        "If there's one word I would use to summarize my career it would be: \"fortunate\". I'm fortunate to have found companies and coworkers who have believed in my skills and provided me with opportunities to learn and grow. I'm greatful to have found consistent and rewarding work.",
        "It's interesting to me to look back at my career since coding bootcamp. When measured in time, it hasn't been very long at all. When measured in growth, I feel like I've gained an eternity's worth of knowledge and experience. When measured against how much more there is to learn, I feel as though I've just gotten started. And I can't wait to find out what's next."
      ]
    }
  ]
}